kylefoxaustin/qemu-imxrt1180/hw/misc/imxrt1180_adc.c
/*
 * NXP i.MX RT1180 LPADC — 12/16-bit SAR ADC.
 *
 * The motor-control analog front-end.  Register-accurate against the MIMXRT1189
 * DFP PERI_ADC.h, with a working conversion engine:
 *
 *   - CTRL: soft reset + FIFO resets self-clear; CAL_REQ reports calibration
 *     complete immediately (STAT.CAL_RDY + GCR.RDY), so LPADC_DoAutoCalibration
 *     returns.
 *   - A trigger — SWTRIG bit t, or a rising edge on hardware trigger input t (to
 *     be routed from an eFlexPWM edge through the XBAR) — runs the command chain
 *     selected by TCTRL[t].TCMD (following each command's CMDH.NEXT), pushing one
 *     tagged result (VALID | trigger-source | loop | data) per command into a
 *     result FIFO.
 *   - Reading RESFIFO[n] pops the oldest result; FCTRL[n].FCOUNT and STAT.RDYn
 *     track the fill level against the watermark and raise the IRQ (IE.FWMIEn).
 *
 * FIDELITY NOTE — there is no analog front-end and no motor plant, so a
 * conversion cannot measure a real voltage/current.  Each result is a fixed
 * mid-scale placeholder (flagged once via LOG_UNIMP), i.e. the reading of an
 * un-energised sensor — NOT a fabricated current.  A virtual-motor plant that
 * turns PWM duty + rotor angle into real phase-current samples is flagged future
 * work; until then a FOC loop closes on ~zero measured current, consistent with
 * "no plant".
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/core/irq.h"
#include "hw/misc/imxrt1180_adc.h"
#include "migration/vmstate.h"

/* Register offsets. */
#define R_VERID     0x00
#define R_PARAM     0x04
#define R_CTRL      0x10
#define R_STAT      0x14
#define R_IE        0x18
#define R_DE        0x1C
#define R_CFG       0x20
#define R_SWTRIG    0x34
#define R_TSTAT     0x38
#define R_TCTRL0    0xA0    /* [8], step 4  */
#define R_FCTRL0    0xE0    /* [2], step 4  */
#define R_GCC0      0xF0    /* [2], step 4  */
#define R_GCR0      0xF8    /* [2], step 4  */
#define R_CMD0      0x100   /* CMDL/CMDH [15], step 8 */
#define R_RESFIFO0  0x300   /* [2], step 4  */

/* CTRL bits. */
#define CTRL_ADCEN     0x00000001
#define CTRL_RST       0x00000002
#define CTRL_CAL_REQ   0x00000008
#define CTRL_CALOFS    0x00000010
#define CTRL_RSTFIFO0  0x00000100
#define CTRL_RSTFIFO1  0x00000200
/* STAT bits. */
#define STAT_RDY0      0x00000001
#define STAT_FOF0      0x00000002
#define STAT_RDY1      0x00000004
#define STAT_FOF1      0x00000008
#define STAT_TCOMP_INT 0x00000200
#define STAT_CAL_RDY   0x00000400
#define STAT_WFLAGS    (STAT_FOF0 | STAT_FOF1 | STAT_TCOMP_INT) /* W1C */
/* IE bits. */
#define IE_FWMIE0      0x00000001
#define IE_FWMIE1      0x00000004
/* DE bits (PERI_ADC.h): FIFO-watermark DMA enables. */
#define DE_FWMDE0      0x00000001
#define DE_FWMDE1      0x00000002
/* TCTRL / FCTRL / CMD / RESFIFO fields. */
#define TCTRL_HTEN     0x00000001
#define TCTRL_TCMD_SHIFT 24
#define TCTRL_TCMD_MASK  0x0F000000
#define FCTRL_FWMARK_SHIFT 16
#define FCTRL_FWMARK_MASK  0x000F0000
#define CMDL_ADCH_MASK   0x0000001F   /* A-side channel                        */
#define CMDL_CTYPE_SHIFT 5
#define CMDL_CTYPE_MASK  0x00000060   /* 0=SingleA 1=SingleB 2=Diff 3=DualBoth */
#define CMDL_ALTB_ADCH_SHIFT 16
#define CMDL_ALTB_ADCH_MASK  0x001F0000   /* alternate B-side channel          */
#define CMDL_ALTBEN      0x00200000   /* use ALTB_ADCH for the B side          */
#define CTYPE_SINGLE_A   0
#define CTYPE_SINGLE_B   1
#define CTYPE_DIFF       2
#define CTYPE_DUAL_BOTH  3
#define CMDH_LOOP_SHIFT  16
#define CMDH_LOOP_MASK   0x000F0000
#define CMDH_NEXT_SHIFT  24
#define CMDH_NEXT_MASK   0x0F000000
#define RESFIFO_VALID    0x80000000
#define RESFIFO_TSRC_SHIFT 16
#define RESFIFO_LOOPCNT_SHIFT 20
#define GCR_RDY          0x01000000
#define GCC_RDY          0x01000000    /* GCC[n] gain-coefficient ready (bit 24) */

/* Un-energised mid-scale placeholder (no analog front-end / no plant). */
#define ADC_RESULT_PLACEHOLDER 0x8000

#define REG(s, off) ((s)->regs[(off) / 4])

static uint32_t fctrl_fwmark(IMXRT1180ADCState *s, int f)
{
    return (REG(s, R_FCTRL0 + 4 * f) & FCTRL_FWMARK_MASK) >> FCTRL_FWMARK_SHIFT;
}

static void adc_update_irq(IMXRT1180ADCState *s)
{
    uint32_t stat = 0;
    if (s->fifo[0].count > fctrl_fwmark(s, 0)) {
        stat |= STAT_RDY0;
    }
    if (s->fifo[1].count > fctrl_fwmark(s, 1)) {
        stat |= STAT_RDY1;
    }
    /* Keep the sticky/W1C flags, refresh the level-driven RDY bits. */
    REG(s, R_STAT) = (REG(s, R_STAT) & ~(STAT_RDY0 | STAT_RDY1)) | stat;

    uint32_t ie = REG(s, R_IE);
    bool active = ((stat & STAT_RDY0) && (ie & IE_FWMIE0)) ||
                  ((stat & STAT_RDY1) && (ie & IE_FWMIE1));
    qemu_set_irq(s->irq, active);
}

/*
 * Drive the eDMA result-FIFO request lines.  The trigger is conversion-driven, not
 * FIFO-space-driven: a request rises when a result FIFO fills ABOVE its watermark
 * (the same level event as STAT.RDYn), gated by DE.FWMDEn and CTRL.ADCEN -- and it
 * falls when the serviced RESFIFO reads drain the FIFO back to/below the watermark.
 * The SDK's lpadc_edma example sets DE.FWMDE0 and points the eDMA at RESFIFO0.
 */
static void adc_update_dma(IMXRT1180ADCState *s)
{
    bool en = REG(s, R_CTRL) & CTRL_ADCEN;
    uint32_t de = REG(s, R_DE);

    for (int f = 0; f < IMXRT1180_ADC_NFIFO; f++) {
        bool req = en && (de & (DE_FWMDE0 << f)) &&
                   (s->fifo[f].count > fctrl_fwmark(s, f));
        qemu_set_irq(s->dma_req[f], req);
    }
}

static void adc_fifo_push(IMXRT1180ADCState *s, int f, uint32_t entry)
{
    IMXRT1180ADCFifo *fi = &s->fifo[f];
    if (fi->count >= IMXRT1180_ADC_FIFO_DEPTH) {
        REG(s, R_STAT) |= (f == 0) ? STAT_FOF0 : STAT_FOF1;   /* overflow */
        return;
    }
    fi->data[(fi->head + fi->count) % IMXRT1180_ADC_FIFO_DEPTH] = entry;
    fi->count++;
}

static uint32_t adc_fifo_pop(IMXRT1180ADCState *s, int f)
{
    IMXRT1180ADCFifo *fi = &s->fifo[f];
    if (fi->count == 0) {
        return 0;                       /* VALID clear -> empty */
    }
    uint32_t v = fi->data[fi->head];
    fi->head = (fi->head + 1) % IMXRT1180_ADC_FIFO_DEPTH;
    fi->count--;
    return v;
}

/*
 * One (side, channel) sample: the plant's injected code, or the neutral
 * placeholder (logged once) when nothing drives that side of the channel.
 */
static uint16_t adc_sample(IMXRT1180ADCState *s, unsigned side, unsigned ch)
{
    uint16_t code = s->channel_input[side][ch & 0x1F];
    if (code == ADC_RESULT_PLACEHOLDER && !s->no_afe_logged) {
        s->no_afe_logged = true;
        qemu_log_mask(LOG_UNIMP, "%s: no plant drives channel %u (%c-side) -- result "
            "is a fixed mid-scale placeholder (flagged)\n", __func__, ch,
            side == IMXRT1180_ADC_SIDE_A ? 'A' : 'B');
    }
    return code;
}

static void adc_push_result(IMXRT1180ADCState *s, int fifo, int t, unsigned loop,
                            uint16_t code)
{
    uint32_t entry = RESFIFO_VALID |
                     ((uint32_t)t << RESFIFO_TSRC_SHIFT) |
                     ((uint32_t)loop << RESFIFO_LOOPCNT_SHIFT) | code;
    adc_fifo_push(s, fifo, entry);
}

/* Run the command chain for trigger source t. */
static void adc_run_trigger(IMXRT1180ADCState *s, int t)
{
    if (!(REG(s, R_CTRL) & CTRL_ADCEN)) {
        return;
    }
    uint32_t tctrl = REG(s, R_TCTRL0 + 4 * t);
    unsigned cmd = (tctrl & TCTRL_TCMD_MASK) >> TCTRL_TCMD_SHIFT;   /* 1-based */
    int guard = 0;

    while (cmd != 0 && cmd <= 15 && guard++ < 32) {
        uint32_t cmdh = REG(s, R_CMD0 + 8 * (cmd - 1) + 4);
        unsigned loops = ((cmdh & CMDH_LOOP_MASK) >> CMDH_LOOP_SHIFT) + 1;

        uint32_t cmdl  = REG(s, R_CMD0 + 8 * (cmd - 1));
        unsigned ctype = (cmdl & CMDL_CTYPE_MASK) >> CMDL_CTYPE_SHIFT;
        unsigned cha   = cmdl & CMDL_ADCH_MASK;                 /* A-side channel */
        unsigned chb   = (cmdl & CMDL_ALTBEN)                   /* B-side channel */
                         ? (cmdl & CMDL_ALTB_ADCH_MASK) >> CMDL_ALTB_ADCH_SHIFT
                         : cha;
        for (unsigned l = 0; l < loops; l++) {
            /*
             * Result FIFO routing by CTYPE: an A-side conversion lands in FIFO0,
             * a B-side conversion in FIFO1.  A DualSingleEndBothSide command
             * converts both sides at once and pushes ONE result to EACH FIFO --
             * how mc_pmsm reads Ia (A-side -> RESFIFO[0]) and Ib (B-side ->
             * RESFIFO[1]) from a single command.  A differential command yields
             * A-B as one FIFO0 result.
             */
            switch (ctype) {
            case CTYPE_SINGLE_B:
                adc_push_result(s, 1, t, l, adc_sample(s, IMXRT1180_ADC_SIDE_B, chb));
                break;
            case CTYPE_DIFF:
                adc_push_result(s, 0, t, l,
                    (uint16_t)((int32_t)adc_sample(s, IMXRT1180_ADC_SIDE_A, cha) -
                               (int32_t)adc_sample(s, IMXRT1180_ADC_SIDE_B, chb)));
                break;
            case CTYPE_DUAL_BOTH:
                adc_push_result(s, 0, t, l, adc_sample(s, IMXRT1180_ADC_SIDE_A, cha));
                adc_push_result(s, 1, t, l, adc_sample(s, IMXRT1180_ADC_SIDE_B, chb));
                break;
            case CTYPE_SINGLE_A:
            default:
                adc_push_result(s, 0, t, l, adc_sample(s, IMXRT1180_ADC_SIDE_A, cha));
                break;
            }
        }
        cmd = (cmdh & CMDH_NEXT_MASK) >> CMDH_NEXT_SHIFT;   /* 0 = end of chain */
    }
    REG(s, R_STAT) |= STAT_TCOMP_INT;
    adc_update_irq(s);
    adc_update_dma(s);          /* results pushed -> a FIFO may cross its watermark */
}

static void adc_hw_trigger(void *opaque, int line, int level)
{
    IMXRT1180ADCState *s = IMXRT1180_ADC(opaque);

    if (level && line < IMXRT1180_ADC_NTRIG &&
        (REG(s, R_TCTRL0 + 4 * line) & TCTRL_HTEN)) {
        adc_run_trigger(s, line);        /* rising edge from the XBAR */
    }
}

static uint64_t imxrt1180_adc_read(void *opaque, hwaddr offset, unsigned size)
{
    IMXRT1180ADCState *s = IMXRT1180_ADC(opaque);

    if (offset + 4 > IMXRT1180_ADC_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB read @0x%" HWADDR_PRIx "\n",
                      __func__, offset);
        return 0;
    }

    if (offset == R_VERID) {
        /*
         * RM 80.6.2 register summary: VERID resets to 0x0200_2C1B (v2.0).  The
         * FEATURE bits are load-bearing: NUM_SEC (bit 11) advertises two
         * simultaneous single-ended conversions and DIFFEN (bit 1) differential
         * support -- LPADC_SetConvCommandConfig asserts on both before it will
         * accept the FOC demo's kLPADC_SampleChannelDualSingleEndBothSide (A/B)
         * command.  A zero-feature VERID (the old 0x02090000) trips that assert.
         */
        return 0x02002C1B;
    }
    if (offset == R_PARAM) {
        return 0x0F041008;               /* RM 80.6.3: PARAM reset value */
    }
    if (offset >= R_RESFIFO0 && offset < R_RESFIFO0 + 4 * IMXRT1180_ADC_NFIFO) {
        int f = (offset - R_RESFIFO0) / 4;
        uint32_t v = adc_fifo_pop(s, f);
        adc_update_irq(s);
        adc_update_dma(s);      /* draining RESFIFO may lower the request line */
        return v;
    }
    if (offset >= R_FCTRL0 && offset < R_FCTRL0 + 4 * IMXRT1180_ADC_NFIFO) {
        int f = (offset - R_FCTRL0) / 4;
        /* FCOUNT (low 5 bits) reflects the live fill level. */
        return (REG(s, offset) & ~0x1Fu) | s->fifo[f].count;
    }
    return REG(s, offset);
}

static void imxrt1180_adc_write(void *opaque, hwaddr offset,
                                uint64_t value, unsigned size)
{
    IMXRT1180ADCState *s = IMXRT1180_ADC(opaque);
    uint32_t v = (uint32_t)value;

    if (offset + 4 > IMXRT1180_ADC_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, offset);
        return;
    }

    switch (offset) {
    case R_CTRL:
        if (v & CTRL_RST) {                       /* soft reset */
            for (int f = 0; f < IMXRT1180_ADC_NFIFO; f++) {
                s->fifo[f].head = s->fifo[f].count = 0;
            }
            REG(s, R_STAT) = 0;
        }
        if (v & CTRL_RSTFIFO0) {
            s->fifo[0].head = s->fifo[0].count = 0;
        }
        if (v & CTRL_RSTFIFO1) {
            s->fifo[1].head = s->fifo[1].count = 0;
        }
        if (v & CTRL_CAL_REQ) {                   /* auto-calibration completes now */
            REG(s, R_STAT) |= STAT_CAL_RDY;
            REG(s, R_GCR0)     = GCR_RDY | 0x10000;   /* unity gain, ready */
            REG(s, R_GCR0 + 4) = GCR_RDY | 0x10000;
            /* GCC[n] is the hardware-produced gain coefficient LPADC_Finish-
             * AutoCalibration polls for RDY then reads: gain = 131072/(131072 -
             * GAIN_CAL).  A zero GAIN_CAL yields exactly unity, so a virtual ADC
             * with no gain error reports RDY with GAIN_CAL = 0. */
            REG(s, R_GCC0)     = GCC_RDY;
            REG(s, R_GCC0 + 4) = GCC_RDY;
        }
        if (v & CTRL_CALOFS) {                     /* offset calibration completes now */
            /* LPADC_DoOffsetCalibration sets CTRL[CALOFS] then spins on
             * STAT[CAL_RDY]; the virtual ADC has nothing to trim, so report
             * ready immediately (as CAL_REQ does for the gain calibration). */
            REG(s, R_STAT) |= STAT_CAL_RDY;
        }
        /* Store CTRL with the self-clearing bits masked off. */
        REG(s, R_CTRL) = v & ~(CTRL_RST | CTRL_RSTFIFO0 | CTRL_RSTFIFO1 |
                               CTRL_CAL_REQ);
        adc_update_irq(s);
        adc_update_dma(s);       /* ADCEN and FIFO resets both move the lines */
        return;
    case R_STAT:
        REG(s, R_STAT) &= ~(v & STAT_WFLAGS);     /* W1C */
        adc_update_irq(s);
        return;
    case R_DE:
        REG(s, R_DE) = v;
        adc_update_dma(s);       /* FWMDE0/1 just changed */
        return;
    case R_SWTRIG:
        for (int t = 0; t < IMXRT1180_ADC_NTRIG; t++) {
            if (v & (1u << t)) {
                adc_run_trigger(s, t);
            }
        }
        return;                                    /* SWTRIG self-clears */
    case R_IE:
        REG(s, R_IE) = v;
        adc_update_irq(s);
        return;
    default:
        REG(s, offset) = v;
        if (offset >= R_FCTRL0 && offset < R_FCTRL0 + 4 * IMXRT1180_ADC_NFIFO) {
            /* A watermark change moves both STAT.RDYn and the DMA request level. */
            adc_update_irq(s);
            adc_update_dma(s);
        }
        return;
    }
}

static const MemoryRegionOps imxrt1180_adc_ops = {
    .read = imxrt1180_adc_read,
    .write = imxrt1180_adc_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 4,
    .valid.max_access_size = 4,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

static void imxrt1180_adc_reset(DeviceState *dev)
{
    IMXRT1180ADCState *s = IMXRT1180_ADC(dev);

    memset(s->regs, 0, sizeof(s->regs));
    /*
     * POWER-ON RESET VALUES from the RM's reset column, verified by
     * tests/imxrt1180-reset-values.  A memset-to-zero is not a neutral default --
     * it is a claim about every bit, and firmware read-modify-writes both of these.
     *   CFG[PUDLY]      = 0x80 (bits 23:16, PERI_ADC.h ADC_CFG_PUDLY_MASK 0xFF0000)
     *   CTRL[CALOFSMODE]= 1    (bit 5,      ADC_CTRL_CALOFSMODE_MASK 0x20)
     *
     *   GCR0/GCR1[GCALR] = 0x10000 -- UNITY GAIN.
     *
     * GCALR is ADC_GCR_GCALR_MASK = 0x1FFFF, a 17-bit Q16 gain: bit 16 is the
     * integer 1, bits 15:0 the fraction.  So 0x10000 is gain = 1.0, and the RM
     * resets it there.  WE RESET IT TO ZERO -- A GAIN OF NOTHING -- and any firmware
     * that reads the calibration back and applies it would scale every conversion
     * to zero.  On the FOC frontier that is a phase current of zero, forever, from
     * an ADC that reports itself perfectly healthy.
     *
     * RDY (bit 24) stays CLEAR at reset, and that is deliberate: calibration has not
     * been requested yet.  The write path already sets GCR = RDY | 0x10000 only when
     * CTRL.CAL_REQ actually asks for it -- the SDK still never spins, it just has to
     * ASK first.  (mcxn947qemu found the same shape and called a hardwired RDY the
     * fourth fabricated-ready in their tree.)
     */
    s->regs[0x20 / 4] = 0x00800000;   /* CFG  */
    s->regs[0x10 / 4] = 0x00000020;   /* CTRL */
    s->regs[R_GCR0 / 4]       = 0x00010000;   /* GCR0: unity gain, NOT ready */
    s->regs[(R_GCR0 + 4) / 4] = 0x00010000;   /* GCR1 */
    for (int f = 0; f < IMXRT1180_ADC_NFIFO; f++) {
        s->fifo[f].head = s->fifo[f].count = 0;
    }
    for (int side = 0; side < 2; side++) {
        for (int c = 0; c < 32; c++) {
            s->channel_input[side][c] = ADC_RESULT_PLACEHOLDER; /* neutral until a plant */
        }
    }
    s->no_afe_logged = false;
    qemu_set_irq(s->irq, 0);
    for (int f = 0; f < IMXRT1180_ADC_NFIFO; f++) {
        qemu_set_irq(s->dma_req[f], 0);
    }
}

void imxrt1180_adc_set_channel_input(IMXRT1180ADCState *s, unsigned ch,
                                     unsigned side, uint16_t code)
{
    if (ch < 32 && side < 2) {
        s->channel_input[side][ch] = code;
    }
}

static void imxrt1180_adc_realize(DeviceState *dev, Error **errp)
{
    IMXRT1180ADCState *s = IMXRT1180_ADC(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &imxrt1180_adc_ops, s,
                          TYPE_IMXRT1180_ADC, IMXRT1180_ADC_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);
    /* Result-FIFO eDMA request lines, one per FIFO (indexed by FIFO number). */
    qdev_init_gpio_out_named(dev, s->dma_req, "dma-req", IMXRT1180_ADC_NFIFO);
    /* Hardware trigger inputs (wired from the XBAR / eFlexPWM edges). */
    qdev_init_gpio_in_named(dev, adc_hw_trigger, "adc-trig",
                            IMXRT1180_ADC_NTRIG);
}

static const VMStateDescription vmstate_imxrt1180_adc_fifo = {
    .name = "imxrt1180-adc-fifo",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(data, IMXRT1180ADCFifo, IMXRT1180_ADC_FIFO_DEPTH),
        VMSTATE_UINT8(head, IMXRT1180ADCFifo),
        VMSTATE_UINT8(count, IMXRT1180ADCFifo),
        VMSTATE_END_OF_LIST()
    },
};

static const VMStateDescription vmstate_imxrt1180_adc = {
    .name = TYPE_IMXRT1180_ADC,
    .version_id = 2,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, IMXRT1180ADCState, IMXRT1180_ADC_SIZE / 4),
        VMSTATE_STRUCT_ARRAY(fifo, IMXRT1180ADCState, IMXRT1180_ADC_NFIFO, 1,
                             vmstate_imxrt1180_adc_fifo, IMXRT1180ADCFifo),
        VMSTATE_UINT16_2DARRAY(channel_input, IMXRT1180ADCState, 2, 32),
        VMSTATE_BOOL(no_afe_logged, IMXRT1180ADCState),
        VMSTATE_END_OF_LIST()
    },
};

static void imxrt1180_adc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = imxrt1180_adc_realize;
    device_class_set_legacy_reset(dc, imxrt1180_adc_reset);
    dc->vmsd = &vmstate_imxrt1180_adc;
}

static const TypeInfo imxrt1180_adc_types[] = {
    {
        .name          = TYPE_IMXRT1180_ADC,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(IMXRT1180ADCState),
        .class_init    = imxrt1180_adc_class_init,
    },
};

DEFINE_TYPES(imxrt1180_adc_types)
